Tekla Open API Reference for Tekla Structures 2025
String Implicit Conversion Operators
Overload List
Name | Description
Implicit(String to String)
 Converts from string to Datatype.String.
Implicit(String to String)
 Converts from Datatype.String to string.
Top
See Also
Reference
String Structure
Tekla.Structures.Datatype Namespace